{"changelog":[{"name":"Completed","version":"1.0.0","date":"20.09.2018","fixes":[" HOTFIX(1-9): Fixed a lot of softlocks and other problems."," HOTFIX(1-8): Improved performance."," HOTFIX(1-9): Fixed a lot of typos in both English and German."," HOTFIX(1-8): Changed wrong equip-values and trade-offers."," HOTFIX(1-9): Fixed wrong icon usage to compare equipment. It is a new option entry for keyboard users."," HOTFIX(9): Fixed a few more things killing you VERY quickly during the final boss fight."," HOTFIX(9): That one box you couldn't push twice during the stealth quest can now be pushed twice."," HOTFIX(10): Fixed favorite items getting mumbled up. Now not mumbled anymore."," HOTFIX(10): Fixed issues with wrong items ending up in your favorites."],"changes":["+ Story Complete","+ More Dungeon","+ More Boss","+ More Party Member","+ More Quest","+ HOTFIX(8): Added trophy tracking","+ HOTFIX(9): Added option to run game while unfocused (now also working!)","+ HOTFIX(9): Added warnings about potential performance issues.","+ HOTFIX(10): Skins now also come with a custom Lea image in the menu!","- No Emotions","- No proper Changelog","~ Sorry, too tired \\i[lea2]","~ HOTFIX(2): Increased amount of free Circuit Resets and added another trading option for them.","~ HOTFIX(8): Retroactively added some rough hotfix-changelogs. Please do not expect them to be complete or perfectly correct.","~ HOTFIX(9): Increased the number of some rare loot-plants (mostly crystals and mushrooms, and, to a lesser degree, bonepiles and cacti).","~ HOTFIX(9): Expanded the traders in Rookie Harbor North a bit.","~ HOTFIX(10): Added small trophy icon denoting every trophy that will become a steam achievement (soon)","~ HOTFIX(10): Skins will now disappear during cutscenes, but also with a nice transition effect."]},{"name":"Internal Test","version":"0.9.9","date":"14.3.2018"},{"name":"More Arts + Languages!","version":"0.9.8","date":"14.12.2017","fixes":["Fixed issues when dropping files into the game's window.","Fixed that text bug with the Krys'kajo midboss.","Fixed bug where you could move through the ceiling in some cases.","Fixed crashing issues when fighting Scorpions and other enemies in Maroon Valley.","HOTFIX(1): Pandza turrets will properly disappear again.","HOTFIX(2): No more crashed for new Henry Quest in Chinese version.","HOTFIX(3): Fixed a crash at the Brewing NPC.","HOTFIX(3): Several small navmap fixes.","HOTFIX(3): Fixed mysterious persistent white dot when dying during Raid event.","HOTFIX(3): Snowman icicles disappear again.","HOTFIX(4): Monster Fibula Fix to not just show all enemies.","HOTFIX(4): Fixed Raid Theme intro timing.","HOTFIX(5): Fixed crashed in Bergen Trail Area.","HOTFIX(6): Several translation fixes."],"changes":["+ All level 3 combat arts have been added! All circuits are 100% complete!","+ Japanese and Korean Localization added!","+ The raid now features a new amazing music track!","+ You can now learn several skills at once in the circuit menu!","+ You now have the option to reset individual circuit skills ","+ Added mouse wheel support to change your elements! You can disable it in the options.","+ HOTFIX(2): Added a trader for Circuit Overrides within the Info Hub.","+ HOTFIX(3): Added option to disable new NPC speech bubble effects.","~ More visual feedback for NPC speech bubbles you can interact with.","~ More enemies can cause status conditions now. Be careful and prepare yourself!","~ Minor changes to equipment and consumables, mostly related to status conditions.","~ Added a few traders in Rookie Harbor, Bergen Trail and Ba'kii Kum.","~ Newcomer's Bridge maps somewhat more polished - all in preparation for Rhombus Square!","~ Plenty more behind the scenes stuff for the big final release.","~ HOTFIX(3): Burn is now weaker by default, though some enemies take more damage.","~ HOTFIX(3): Some changes to status condition attacks and resistances of enemies.","~ HOTFIX(3): Increased loot-droprate from some enemies (mostly medium sized).","~ HOTFIX(3): Small adaptions to Brewing- and Bergen Monk-quests","~ HOTFIX(3): A bit of balancing of the Wet Work quest.","~ HOTFIX(4): Blazing Dragon will make you jump not quite as high now.","~ HOTFIX(6): Allowing 2 food-buffs by default instead of 1.","~ HOTFIX(6): Changed some buff-durations. Higher-tier food also tends to last longer.","~ HOTFIX(6): Significantly increased healing rate of \"Essence Drain\" and \"Vital Pulse\" (Wave Ranged Arts).","~ HOTFIX(6): Jolt damage is slightly lower and can no longer be a critical hit."]},{"name":"Ridge and Trophies","version":"0.9.7","date":"13.10.2017","fixes":["Map Pin Menu now closes correctly when closing the menu.","The Enemy Info in the Analyze Menu does not get stuck anymore when multiple Analyzables are next to each other."," Various mapping bugs fixed, thanks to our community!","Lot's of typos, thanks again everyone \\i[lea]","A lot of smaller fixes.","HOTFIX(1): No crashing when using the elevator in the Temple Mine.","HOTFIX(1): Several text fixes for Trophies.","HOTFIX(1): Fixed a jump panel in a cave in Sapphire Ridge.","HOTFIX(2): C'tron not called Buggy anymore in Lore entry.","HOTFIX(2): No crashes when talking to brewing quest NPCs.","HOTFIX(2): Proper Science Table in Nerd Hub + further map polishing.","HOTFIX(2): Small Shad appearance fix during a certain boss fight.","HOTFIX(3): No more soft locking issues in Ocean Battle quest, hopefully!","HOTFIX(3): Fixed Lore portraits.","HOTFIX(3): Fixed Schneider's pose in certain scene.","HOTFIX(3): Fixed issues with Emilie comments not repeating properly after respawning.","HOTFIX(3): A few improvements in the cursed temple.","HOTFIX(4): No more overflowing buy count in shopping menu.","HOTFIX(4): Fixed save block issues with ocean quest.","HOTFIX(4): Improved sorting of modifiers."],"changes":["+ New Area: Sapphire Ridge! Including some Bugs :< Poor Emilie!","+ Trophies! They're finally here. Not connected to Steam Achievements yet and of course not all are obtainable as of now, but you can already grind over 150! Toggle notifications in the options menu.","+ New Quests in Rookie Harbor, Ba'kii kum and Autumn's Fall. All of them come with cool and new gameplay mechanics.","+ New Equipment. You are fighting new foes, so of course you need new weaponry!  ","+ Overhauled Portraits: Round 2. We finally changed every Portrait in the game for the new style. This even includes those shadowy portraits. They now look less terrifying, yeah!","+ Random Spheromancers now roam CrossWorlds. But you might only rarely see them, being the least played class and all.","+ New and updated sound effects for environment and enemies. Hint: play the heat temple again.","+ New music to accompany you in Sapphire Ridge!","+ New map pins: Arrows! Also decreased the distance at which you can put pins.","+ Options added to toggle particle effects, weather and lighting.","+ The Pub in Rookie Harbor is finally open for business!","+ The Nerd Hub got a huge overhaul and now features unique NPCs that explain the different aspects of the game much better.","~ HOTFIX(4): Improved Charge Effects! Now with matching element colors.","~ Small Changes to some maps including most notable the Autumn's Rise area.","~ Renamed \"Achievement\" item to \"Precursor Shard\" to avoid confusing, obviously!","~ So much behind the scenes stuff for the big final release."]},{"name":"The Story Continues!","version":"0.9.5","date":"30.06.2017","fixes":["Overlapping side messages with the boss bar.","Quest EXP now again not reduced due to party members. Sorry!","Not getting a level up message when dying between checkpoints.","Fixed water blocks not being properly integrated into the navigation system."," Disappearing SP bar when switching elements right after using a Combat Art.","Fixed broken name display of maps and areas in the save menu when switching between languages.","Fixed first time language assignment leading to errors.","Fixed \"hour\" display in playtime. Now correctly displays over 60 hours. You madman.","HOTFIX(1): No more freezes when fighting scorpions.","HOTFIX(1): Less likely to crash when starting game and having very old saves.","HOTFIX(1): Will accept saves with uncompletes quests that have been removed.","HOTFIX(1): You can not move during trade dialogs anymore.","HOTFIX(2): Another crash issue fixed.","HOTFIX(3): Even more crash issues fixed.","HOTFIX(3): Fixed several typos and missing texts.","HOTFIX(3): Enemies will now appear in your Fibula again when defeated.","HOTFIX(3): Fixed several path finding issues.","HOTFIX(3): Several fixes for Master Sensei Quest.","HOTFIX(3): You can now enter that one map in Bergen Trail again without infinite loading.","HOTFIX(4): You can now save again after catching the baby goat.","HOTFIX(4): Small fix for being stuck at barrier east of Autumn's Fall.","HOTFIX(4): Several fixes for typos and battle properties. C'tron got proper elements for his specials now.","HOTFIX(4): Removed some stones.","HOTFIX(5): Updated graphics for invincible monk-guardians and a certain fiery questbovine.","HOTFIX(5): Some minor improvements to the Monk Trials in Bergen.","HOTFIX(5): Changes to brewing ingredients.","HOTFIX(5): Applied lots of spelling fixes by the community. Thanks a lot! \\i[lea]","HOTFIX(5): Party members will now attack heat bugs with cold. Not heat.","HOTFIX(5): Status Healing + Bomb removal after each PvP Round.","HOTFIX(5): Fixed problems with quicksand respawning.","HOTFIX(5): Lot's of Apollo AI fixes! Should hopefully not stand around idling anymore.","HOTFIX(5): You can't kill a certain boss anymore and there should be less issues with the fight in general.","HOTFIX(5): New battle theme should loop better + other small music fixes."],"changes":["+ The story finally continues! Join Lea and her friends and find out more about her past.","+ Party Members can now consume items and hold a certain amount of healing potions. They will automatically use and restock them.","+ Added MELEEE & GUARD buttons! Yeaaaah! Go into the keybindings to set your key! Gamepad users can use X\/Square to melee and B\/Circle to guard.","+ New quests found found all over the place. Also replaced Rookie Harbor \"Fetch Quests\" with a new training quest.","+ Map Pins! You can now place pins on the map wherever you want with many symbols to choose!","+ Dash Cancel stat. Your awesomeness in numbers.","+ New countdown UI! Whenever there's a timed quest we can now send you off with a nice animation. ","+ New score UI. Expect quests where you need to reach a certain score!","+ Added option to disable element switch in quick menu.","+ Added option to disable mouse melee input (Because we now have custom buttons for that, remember???)","+ New Music. Lea now has her own theme!","+ HOTFIX(5): The new Bulletin Board Menu can now be found within the Quest Hubs and will show you quests of the area!","+ HOTFIX(5): Item consumables now have individual sprites visible on consumption!","+ HOTFIX(5): Improved German Translation for the Cargo Ship! Will be hopefully extended until the next release.","+ HOTFIX(5): New shiny effects when activating skills in the circuit menu!","+ HOTFIX(5): There is now a proper chapter 6 with new save state image.","~ Language options have been updated to support multiple languages for the future! We also got flags now!","~ Common Steel & Silver and most uncommon equipment (from traders and chests) has been buffed in terms of stats.","~ Status effects have been tweaked! They should be easier to pull of now and some enemies are more likely to get inflicted by them.","~ The status effect display on enemies has a slight change and is now less buggy.","~ Usual Balance change to quest rewards and combat. Spoiler: HP regen got some nerfs.. :<","~ Saving now also updates the latest checkpoints, so when you die you at least keep everything you had at the checkpoint.","~ More enemies have damage ceilings now to avoid frustrating one-shot kills by enemy attacks.","~ Updated Buff icons. Looking good!","~ You can now check out what a Buff does in the help screen!!! Just hover over a buff and move to the bottom left to see exactly what each icons means. Finally!","~ Using the D-Pad in the item\/party quick menu is now possible again.","~ HOTFIX(5): Master Sensei quest can now be canceled via Pause Menu + VRP bounce solutions are hopefully more clear now.","~ HOTFIX(5): Added small hint about jumping over lillies in Maroon Valley.","- Removed fetch quests from Rookie Harbor Quest Hub. We now have enough other quest with much better gameplay that make a better first impression, yay \/o"]},{"name":"Chinese Translation","version":"0.9.2","date":"May 16th, 2017","changes":["+ Chinese Translation added! We can't even read this and really hope it's good!","+ CrossCode now starts without archive extraction making startup much faster!"]},{"name":"High Quality Voice Acting","version":"0.9.1","date":"April 1st, 2017","changes":["+ High Quality Voice Acting for most main characters! Listen to the voice of Lea, Emilie and others! ","- HOTFIX(1): Happy April Fools Day! Voice Acting has been removed again. If you really miss it, you can enable it again temporarily with the Bonus Code \"Best-VA\""]},{"name":"Journey to the Tree","version":"0.9.0","date":"February 27th, 2017","fixes":["Fixed various bugging NPC movement around the world.","Fixed tons of typos found by our lovely community.","Fixed long standing issue if wrong icons in Monster Fibula.","Fixed being able to talk to NPCs again before a quest could be finished.","Various other bugs ","HOTFIX(2): You now can actually enter Grand Krys'kajo.","HOTFIX(3): No more Elemental Mode Changes from the Title screen.","HOTFIX(3): Fixed crash issue in Jet's Tutorial.","HOTFIX(3): Fixed several crashes when talking to Quest NPCs","HOTFIX(3): Fixed crashes after respawning and when loading autosaves.","HOTFIX(3): Blizzard Hawk won't freeze certain enemies forever anymore.","HOTFIX(3): Fixed Lea Poses with Holiday Hat.","HOTFIX(4): Several tutorials fixed.","HOTFIX(4): No more respawning Chest in Drillertoise Quest Cave.","HOTFIX(4): No more idling damage sums for disappearing and self-destroying enemies.","HOTFIX(4): Bluerays in Grand Krys'kajo are less likely to fall out of bounds.","HOTFIX(4): Fixed issues with stored side messages.","HOTFIX(4): Trading menu fix for item counts of equipped items.","HOTFIX(4): Fixed Quest Summary display bug.","HOTFIX(4): Magnet position is now properly saved when reentering maps.","HOTFIX(4): Physics fixes relevant for high FPS usecases.","HOTFIX(4): Fixed issues with Appetite modifier.","HOTFIX(4): Fixed crashes when using shock combat arts on certain targets."],"changes":["+ Level 2 Combat Arts Unlocked! You can now learn Level 2 combat arts on ALL element trees. Yes, all of them. Get ready for awesome special attacks.","+ All passive skills done! All these feisty \"Not Implemented\" skills are now accessible. Make sure to check them all out. You might find some very interesting new ones.","+ All status conditions implemented! Cause \"Jolt\" with the Shock element to mess with your enemies' movement or \"Mark\" them with the Wave element to give your projectiles more punch!","+ Party member! C'tron joins the fray. When you start the game and reached the current end of the story you can now invite C'tron to your party.","+ Party Member Combat Arts. Party Members can now execute Combat Arts too! You can adjust how they are displayed in the options menu.","+ New Strategy Menu. Tell your party members who to attack, what play style to use and how often to use combat arts.","+ Swap Branches Display! When entering the Swap Branches option in the Circuit Menu, you can now see what skills change on the right side of the screen. Fancy that.","+ New SP Bar! This pops up when executing Combat Arts and tell how much SP you are consuming. Same goes for recovering SP. Don't like it? Toggle it off in the options menu.","+ Info HUB extended. The Info HUB in Rookie Harbor now features a base floor where you can test you skills against enemies while always having all the SP you need.","+ Total damage numbers! When attacking an enemy you now see a single damage number the grows as long as you pummel an enemy showing the total damage you inflict. You can toggle this off in the options menu. Thanks for the fine folks over at PixelFerrets from Secrets of Grindea for the inspiration.","+ New Quests in Ba'kii Kum and Basin Keep. Will you finally be able to enter the black market of Basin Keep?","+ New Trade offers in Ba'kii Kum, both from old traders and entirely new ones!","+ Icons in Map Menu. The map menu now features icons directing you towards trading posts and quests. We will add more icons as we go along with the development.","+ More ambient sounds for all areas. Finally you can hear those waterfalls!","~ New Help! Every single menu (That includes the trade dialog) now has a Help Screen where you can focus certain elements and get a quick explanation for it. Check what modifier do right in the equip screen, no more switching needed!","~ Reworked Stun System. Stuns can now be broken out of with a Dash. A small UI will indicate whenever this is possible. But be aware your enemies can do the same.","~ Made the Horncave a bit easier by adding checkpoints and reducing the enemy numbers in the final battle.","~ Main Menu Button Sorting changed! Quests are now at the very top! while Map has been moved to Synopsis. (You can still access the map menu via the Quick Menu, as usual). ","~ Buff items can now be overridden and Stat changes are displayed in the HUD when using Buff items. Additionally you now start with only one buff slot, but can extend it via the circuit tree.","~ Rebalanced many of the existing Combat Arts. The bread&butter flamethrower got nerfed a bit, sorry!","~ HOTFIX(3): Charged Balls can now cause Status Conditions (experimental, might change again).","~ HOTFIX(3): Some Combat Arts switched between branches.","~ HOTFIX(3): Buffed some Passive Skills.","~ HOTFIX(3): Added some new modifiers to old equipment.","~ HOTFIX(4): Reduced Wowturbine's MHP and gave the regeneration a startup-time.","~ HOTFIX(4): Disable GPU blacklist by default. Should hopefully improve experience for some users.","~ HOTFIX(4): Improved Navigation a bit further. Let's hope that things won't break!","~ HOTFIX(4): Minor combat art and skill balancing.","~ HOTFIX(4): Several fixed and improvements in menus."]},{"name":"Water Temple + More Jungle","version":"0.8.5","date":"December 13th, 2016","fixes":[" Fixed being able to get squished between two movable blocks.","Fixed modifier display in inventory\/trade screen when modifiers has no percentage.","Quest\/Level-Up displays are not saved anymore when saving.","Buffs are now properly removed when returning to the title screen. Also Buffs are not depleted in scenes anymore."," HOTFIX(2): Removed walls so you can properly enter the new area of the jungle."," HOTFIX(2): You can now enter that cave of the new Ba'kii Kum Quest."," HOTFIX(2): Adapted barrier in Temple Mine to make puzzle solvable again."," HOTFIX(3): That Shad NPC won't crash the game anymore."," HOTFIX(3): You can save again after the new quicksand hole introduction."," HOTFIX(3): Several small fixes in new jungle area and old dungeon rooms."," HOTFIX(4): Critical NPC bugfix - might lead to new issues! Please report strange NPCs if you see any!"," HOTFIX(4): Fixed playback of positional sounds in case you wondered about sounds occasionally being played really really quiet."," HOTFIX(4): Improved Zir'vitar Temple BGM."," HOTFIX(4): Emilie is now bearable during the \"Blasting Shells\" quest."," HOTFIX(4): Limited amount of parallel compressors to avoid performance drain."," HOTFIX(4): Several Navigation improvements. Emilie now won't use deactivated jump panels!"," HOTFIX(4): Wave Tree reset fixed FOR REALZ NOW."," HOTFIX(4): Combat Rank Tutorial working properly again."," HOTFIX(4): More fixes for dungeons and puzzle elements."],"changes":["+ Wave Dungeon! Unlock the shock element in this new dungeon which you can find on the left side of the \"Rite of Passage\" map inside Gaia's Garden.","+ Shock Element. This element mode focuses on fast movements and quick attacks. Get ready for a shock!","+ Shad Settlement In Gaia's Garden. Explore this new part of the jungle. Meet the local shad tribe, but they might not be as friendly as the one you met in Ba'kii Kum.","+ Eastern part of Basin Keep. Home to the people that build the city and the power plant.","+ Radiant Key. This will allow you to open golden chests and can be found inside the new Wave Dungeon.","+ New chest graphics for bronze\/silver and golden chests as well as dungeon chests that contain keys.","+ New quests found in Ba'kii Kum! Maroon Valley just got 100% more awesome.","+ More German Translations! Sehr schön!","~ Trade menu now always displays the equip stats of the item you can get unless a selected required item is also equipment.","~ Changed sound playback to make positional sounds more consistent. No more distant splash sounds!","~ \"Trade Book\"- and \"Botanics\" Menu Tabs are now sorted for better overview.","~ Changed wave compressor. The behavior of the large wave ball including the puzzles should be more clear now.","~ Several map adaptions like puzzle fixes and chest placements."]},{"name":"Spooky Halloween Update!","version":"0.8.3","date":"October 28th, 2016","fixes":["Some minor menu issues resulting in buggy menu behavior. ","No more stacking Guarding Gale Guard Art.","Improved flying enemy behavior.","Hotfix(2): Fixed loading issue when no save files exists.","Hotfix(2): Fixed crashes with sound playback (hopefully)."],"changes":["+ The new \"Botanic\" menu is here. Now you can look up how to get those precious vegetarian trade-items... after harvesting them for a while. Unlock it along with a new quest at the end of Autumn's Rise!","+ The infested area of Gaia's Garden is finally open, along with new trade items and treasure!","+ A spoooooky~ Halloween quest has been added. You can find it in Basin Keep!","+ New music for Gaia's Garden and Basin Keep!!","~ Rebalanced some Combat Arts and switched around the Guard Arts in the Wave Circuit.","~ Changed stats of the \"Disciple Gloves\".","~ Some more small tweaks of the Hermit-puzzle.","~ Added updated graphics for certain special goats!","~ Quest detail view can now display larger NPCs, no more weird clipping.","~ Hotfix(2): Adapted Botanic Prerequisite numbers.","~ Hotfix(2): Verdant Strike nerfed."]},{"name":"More tweaks... for honor!","version":"0.8.2","date":"October 7th, 2016","fixes":["Fixed chest count in Zir'vitar Temple.","Fixed that really... awkward bug during the landmark tutorial.","Finally no more chest opening while jumping!","No more crashes when doing a guard counter on Apollo.","Player won't slide when opening chest and walking through doors, avoiding weird collision bugs etc.","Fixed crash issues during goat quest.","New combat arts have proper names and descriptions in German.","Several Menu display bugs fixes.","Elemental resistance buffs now work correctly and won't make you literally invincible to the elements!","Fix issues with second parkour quest... hopefully!"," Fixed wrongly display HP bar after Emilie upgrades her equipment.","No more walking out of the southern end in Bergen.","You actually see the keyboard and gamepad button icons when you get the wave element.","Fixed some typos and expanded the German Translation to Autumn's Rise (Story only)","HOTFIX(2): Fixed saving issues on Linux and OSX.","HOTFIX(3): Fixed issue where bombs were easily falling off from sliding blocks.","HOTFIX(3): Fixed rendering issues and incorrect percentages in enemy elemental resistance display."],"changes":["+ More accessible chests in the jungle & Dungeon! Most of the golden chests have been replaced.","~ New system for saves! Don't worry, your saves are still there, but now there are no more bugs with too many saves!","~ Combat arts balances! Modified damage factors and longer delay for some throw arts.","~ Modified SP gain on damage calculation. SP gain should be slower than before.","~ Emilie now more clever when fightning jungle enemies!","~ The combat behavior of the enemies in Autumn's Fall has been expanded.","~ Ball Element Changer won't modify attack power and SP gains of transformed projectiles. No more imba flame thrower exploit, you guys!","~ No more element changes during charging - it resulted in very strange bugs.","~ Changed \"Chlg. of Aspiration: No Shield\" to be truly \"No Shield\" until the end. ","~ All Monk-caves now save individual times for each mode. Also added some minor convenience-tweaks.","~ Changed the first switch in the puzzle of \"Heating the Hermit\" to quicker clarify the main-theme of the room.","~ More puzzle improvements in Zir'vitar Temple."]},{"name":"Bug squashing!","version":"0.8.1","date":"October 3rd, 2016","fixes":["Updated chest count in Bergen.","A bit of puzzle balancing and improvements in Zir'vitar Temple.","Improved item destructible probability issue when using Lucky Lucky.","Fixed crashes when using Icicles against Ectovolts!","Quest solve dialog will now also show after dying in combat.","EXP and credit balancing for new areas, especially Autumn's Fall.","Fixed occasional issues when skipping shock boss intro scene.","Removed a sliding block in cold dungeon that was added for testing... whoops!","Fixed a little skip in shock dungeon.","Just one heat golem per room, please!","Shop NPC in Basin Keep with Icon!","Player now doesn't slip inward when stunned.","You can't grab that upper block anymore!","Fixed enemy spawners in Autumn's Fall.","Removed a buggy NPC that was talking nonsense.","Guarding Gale doesn't push immobile enemies away anymore."]},{"name":"Ruins, Jungle, City, Moar!","version":"0.8.0","date":"October 2nd, 2016","fixes":["Prevented regaining the shield in \"Chlg. of Aspiration: No Shield\" after falling during the last part.","Improved navigation of a certain lonely snowman in Bergen Trail.","Fixed percentage calculation for some equipment display 15% as 14 and such.","Improved list navigation.","Resistance buffs from consumables now work properly.","Fixed team size display in social menu.","Auto throwing on gamepad doesn't block dashing anymore.","You still get full EXP when entering a dungeon with a party that doesn't help whatsoever.","Quests now give you full EXP even when in a party."," HOTFIX(2): Fixed crash in beginning of the cargo shop sequence."," HOTFIX(2): Guard now blocks shots in Monk Quest again."," HOTFIX(2): Sliding blocks now won't stop before floor switches."," HOTFIX(2): Filled a missing chest in Autumn's Fall."],"changes":["+ New area \"Autumn's Fall\". An autumn-themed area housing many ancient ruins.","+ New area \"Gaia's Garden\". A colorful jungle filled with new threats, secrets, and parrots with Gatling Guns.","+ New city \"Basin Keep\". This is just the beginning with basic exterior and few NPCs, but you can already feel the rainy atmosphere!","+ New dungeon \"Zir'vitar Temple\", with a shock theme! This is the first of 3 smaller dungeons!","+ New element mode \"Wave\" complete with 5 new combat arts!","+ The first level 2 combat art \"Spiral Dance\" (neutral mode, melee). This is still rather experimental, so please give it a try!","+ New menu: Status Menu. Check out all your parameters for each element and get a description for all your modifiers.","+ Added toggle between equipment menu and status menu.","+ Option to toggle modifier list to display more modifiers in equipment menu.","+ Added an info-sign and short tutorial quest in the Seeker HUB of Rookie Harbor to introduce players to the quest-giving factions.","+ Two new Quests in Rookie Harbor that also unlock a new trader. Finally  some real use for the Raw Meat!","+ 5 new quests plus 3 associated challenges in Bergen! Now all the resident factions have 2 quests each, each of them with different themes. Have fun~!","+ New Modifier: Avenger! Restores (quite a lot) SP when guarding attacks, double that when you perfect guard an attack.","+ Regular enemies now respawn consistently in all dungeon! That also includes Digmos in the Temple Mine. Just revisit the enemy rooms!","~ Lea now won't slip down from edges but instead move back to the platform. Less frustration with platforming? Maybe!","~ Adjusted Critical Hit-Chance (doubled base-chance to 10% and increased the effect of Focus).","~ Buffed basically all \"HP-Regen over time\"-effects (food, equip and skills) and decreased tea-prices.","~ Neutral Combat Arts changes: Steel Ball is now larger with less bounces, Azure Strike and First Cut do slightly more damage.","~ Cold Combat Arts changes: Hail Flurry nerfed, was seriously overpowered.","~ Some minor changes in the Heat-&Cold-Circuits.","~ Modified dropped items of cactone plants, now dropping similar items in all areas.","~ Changed some equipment modifiers (mostly added \"Legwork\"-mods to certain Leg equipment).","~ Rookie-Equipment can now be sold.","~ Changed around the early trading offers a bit (most is easier to get now).","~ Raw Meat is slightly easier to get.","~ Penguins now love water.","~ The quests for the 4 factions in Rookie Harbor now require the tutorial quest to be started first and are slightly rewritten.","~ The \"First Steps\" Quest now only gives one weapon as a reward instead of two.","~ The second tier of quests in Rookie Harbor give less EXP now","~  \"Smuggle Trouble\"-quest is now somewhat easier (slower bullets, one less ricochet-wall and added health drops in last part).","~ Changed many item rewards for quests in Rookie Harbor and Bergen","~ \"A Promise is a Promise\" is now level 15.","~ Reorganized the \"Fancy Tophat\"-Quest in Bergen with a new start\/end-NPC and rewritten dialogue.","~ Renamed the \"Aspirant's\"-Quests and increased the time in the \"Timed\"-challenge to 2:00.","~ Adapted EXP leveling curve. Exp will decrease slower when close to enemy level.","~ Quest EXP modified, slightly higher with higher levels. Also nice even numbers!","~ Test of Surprise Room in Faj'ro Temple now... less frustrating."]},{"name":"All the Fixes! Maybe.","version":"0.7.1","date":"June 22nd, 2016","fixes":["No more Emilie exclusion from Blue Hedgehag Battle + other fixes.","Testing room in Ba'kii Kum that you were not supposed to enter can now in fact not be entered.","Small improvements of the monk quest.","Fixed missing chapter lore for old saves.","Fixed strange teleport issues in meerkat boss cave.","Fixed save&teleport being wrongly deactivated during some quests.","Enemy loot adjustments.","Fixed missing ' during dream sequence.","Lots of spelling and grammar fixes - thanks everyone!"],"changes":["~ Smoother Parallax movement.","~ Adapted BGM during Monk Trial.","~ Changed values and modifiers of certain equipment (mostly headgear and fists)."]},{"name":"STORY TIME! + New Faces","version":"0.7.0","date":"June 20th, 2016","fixes":["Fixed flame thrower going through blue block walls.","Fixed not being able to skip contacting people in social menu.","Fixed tons of typos! Thanks community <3","Fixed bug that occurred when loading save file while doing a timed quest.","Fixed various mapping bugs.","Fixed getting stuck in some fights in heat dungeon."],"changes":["+ Large Story update! Finally connecting all those areas you already visited with previous scenes and new people!","+ Traders Book! Ye who asks, shall receive. A new menu that lists all traders you have visited (including location, aw yeah).","+ Ba'kii Kum now has some proper houses and more NPCs. More will come in the future as usual.","+ Some new quests found in Bergen. ","+ Since you meet new people you can now find a new tab in the social menu under which you can contact some of them!","+ First Wave of new face graphics! Including Lea, Emilie, Schneider and more.","+ New lore can now be found! Uhhhhh.","+ The Faj'ro Temple now has a unique theme, enjoy!","+ Circuit blocks added! You now need certain \"shades\" found by progressing the story to unlock blockades in the Circuits menu.","~ New Lea graphics changed through out the game (look at that new Title-Lea!)","~ Tweaked equipment cost for Ba'kii Kum gear.","~ During event based fight, the quest-hud and combat rank are now turned off. (to avoid both clutter and exploits)","~ Made boss fight and equip battle in Rhombus Dungeon easier.","~ Triggering side dialogs during gameplay is now more consistent.","~ Modified Blue Hedgehag. It's a now a more special boss and finally has an idle animation.","- Due to the large amount of new stuff we weren't able to finish work on the new observatory, sorry! "]},{"name":"The usual Fixes!","version":"0.6.1","date":"Mai 9th, 2016","fixes":["All those bugfixes from the dev stream!","Carla won't crash the game anymore, because the shopping option has been removed. Get used to visit the stores in town!","Fixed chest count in Autumn's Rise.","Using wide range attacks will now always hit the head of the new boss enemy.","Fixed that weird bug when touching a certain barrier in Maroon Valley from the upper level.","Quest giving cabinet that made game crash has been removed.","Properly fixed crashed when entering the Synopsis menu.","Fixed spelling issues and \"missing labels\".","HOTFIX(2): Fixed bug with Keeper skill resulting in credit display issues."],"changes":["~ Some price and trading offer adaptions.","~ A few enemy placement adaptions in Maroon Valley."]},{"name":"New Area, Dungeon, Moar","version":"0.6.0","date":"Mai 8th, 2016","fixes":["Several optimizations and fixes for navigation. Should run smoother now!","Fixed memory leak.","Fixed props nudging weird sometimes.","Fixed tons of typos thanks to users! Thanks everyone <3","Fixed various collision bugs in areas.","Fixed UI bug when quests are solved without any notification."," HOTFIX(2): Fixed crash when opening synopsis in one of the new save presets"," HOTFIX(3): Fixed crash on Linux + doors in Ba'kii Kum"],"changes":["+ Added area: Maroon Valley! Explore a dry and hot area eroded by time and inhabited by the \"Shad\". You will also encounter 4 new enemies here!","+ Added dungeon: Faj'ro Temple! A whole new dungeon including new puzzles and new foes.","+ Added village: Ba'kii Kum! A village set a small valley inhabited by the Shad. mysterious natives of Shadoon.","+ Added Cold element. Finally the second element is here complete with circuit tree to explore! Including 4 new Combat Arts.","+ Real Shop Menu! a new and shiny menu to buy and sell items. Yes, you can now buy multiple items at once. Oh Yeah.","+ New Quests! Find new quest all over CrossWorlds. Expect more then just \"fetching\" stuff!","+ More fitting NPC. Each of the different factions on CrossWorlds now comes with unique NPCs for them.","+ AI Learning. Your party members now learn enemies and are capable of finding their weak points too! ","+ Option to display a minimized version of favorite quests with just the quest name and the prozentual completion of the quest.","+ New items for trading. Get them in the new area or by pummeling enemies.","+ Timers. Timers will mostly be used for quests! Gotta go fast.","+ Guard with Mouse. Yes, you all have been waiting and we finally added it! You now aim you shield with the mouse!","~ Lots of Trading changes. A lot of Traders moved or sell different stuff now.","~ Trading now costs money! Something we wanted to do for ages. Money now becomes more valuable.","~ Tons of enemy changes. Enemies now drop less money but stronger enemies have higher chances of dropping loot.","~ Autumn's Rise changes: All cargo-crew members are now gone, so is the blue guy (no more blue crab for now!). The Observatory is closed for now too, but will be re-opened with [redacted]!","~ As usual we fixed mapping bugs and changed some mapping in some spots. You might even find a new chest or two.","~ Quests can now have hidden maximum requirements.","~ NPC Runners now run on smarter paths through maps.","~ Quests can now have sub-quests! ","~ If a lore entry or a quest has a parent an arrow not indicates that and makes the lists in the lore- and quest menu more readable.","~ Circuit Tree now supports swapping branches in all trees. Input for gamepad has been changed to a cursor, much like the detail view.","- As mentioned above, all cargo members are gone now. This means no more captain quest! It will be replaced with something better in the next version, promise!"]},{"name":"Fixes, Fixes, Fixes!","version":"0.5.1","date":"February 12th, 2016","fixes":["Wrong save slots when deleting save file in load menu."," Lea being able to use items in Apollo fight. No more cheating!"," New symbol for \"new\" entries in encyclopedia.","Small typo fixes reported by players. Thanks everyone!","Emilie will now no longer stand around in Rookie Harbor west when not in party.","Correctly count Apollo as defeated for Monster Fibula. Also tweaked some of the requirements for the Reports.","Fixed Joern being displayed as \"Jörk\".","Fixed enemy targeting for party members and party members targeting enemies that are not aggressive.","Fixed Records Menu displaying gibberish. Now works as intended.","Removed \"Real Planet\" reference. Will be explained later to make more sense."],"changes":[" Added more possible Avatar names."]},{"name":"Story, Menus and Party","version":"0.5.0","date":"February 9th, 2016","fixes":[" Fixed slowdowns in bergen by using a new way to let the navigate through the maps"],"changes":["+ Party Members! We finally did, you can now have party members join you on your journey. Your first party member? Why, Emilie of course!","+ Added Encyclopedia  Menu. Dive into the lore of CrossCode! Not all entries are accessible as of now, but we'll add more over time  ","+ Added Monster Fibula Menu. Get a detailed look at every enemy in the game! Defeat them multiple times to unlock the second page!","+ Added Analyze Mode! Access it via the Quick Menu and analyze your environment, including enemies and NPCs!","+ Added Party Strategies! Give your party members orders! simple and clean.","+ Added Records Menu! CrossCode finally in numbers. Everything is listed from your overall completion to the numbers of times Lea said \"Hi\". If you load an old save, some stats might seem wonky! If anything is off when starting a new game, please tell us! ","+ Added Social Menu! Contact other avatars in your list and invite them to form a party. You can also just chat with them if you like!","+ More Story! Find out what you goal in CrossWorlds is and have a duel with a certain player!","+ Added NPC names! Using the new Analyze feature you can now see the name of avatars and special NPCs! quest givers, shops and traders even have special colored icons for you to quickly find them. ","+ New update messages for Quests, Landmarks and Lore stuff. Don't like it? Change the style in the options menu!","+ Factions! CrossWorlds is home to 4 factions and you can visit 3 of them as of now! Go visit them in Rookie Harbor!","+ More Sounds! We added a bunch of new sounds for various stuff like opening\/closing the quick menu order using the teleport feature.","+ New Music! Bergen Village now has a proper theme.","~ Moved the Options Menu to the Pause Menu. Making room for a the Party Menu! ","~ Changed dialogs for some quest NPCs.","~ Some mapping changes in Autumn's Rise to accommodate for the new maps.","~ Saving is now faster! Having a lot of saves now should lead to less lag when saving.","~ More Bergen NPCs! Finally the town is getting more citizens. But there are still more planned!","~ Slight adjustments to chests all over the game","~ The Quest Hub in Rookie Harbor is now much more crowded!"]},{"name":"Happy Holiday Release!","version":"0.4.1","date":"December 24th, 2015","fixes":["Cold bugs won't spawn from eggs in certain places... like next to the mid boss.","Fixed softlock issue during fight in Control Room A, Temple Mine.","Fixed a room that was never discovered on the map","Temple mine now displayed as dungeon on world map.","Fixed a door that could not be entered in temple mine.","Fixed issues where save presets could not be loaded when game had no saves yet.","Several spelling fixes as usual!"],"changes":["+ Implemented two new heat combat arts!","+ New fancy save and load menu! Makes saving so much more satisfying!","+ New special quest for the holiday season! Look out for the \"Holiday Man\"!","~ Snowman actually weak to heat now!","~ Balanced some trade offers.","~ Adapted quest levels.","~ Ice blocks won't regenerate as fast in some critical places. "]},{"name":"Bergen, Dungeon & Guard","version":"0.4.0","date":"December 1st 2015","fixes":["Fixed map menu cursor having jerky movements sometimes. ","Fixed the usual mapping glitches! Dang those glitches!","Lots of smaller issues. ","Rare bug when switching areas in map menu leading to invisible maps. "],"changes":["+ New Area: Bergen Village! Its pretty empty right now because we focused heavily on the new dungeon, but more stuff will be added over the month! ","+ New Dungeon: North of Bergen Village you find a new dungeon! This one is much larger with lots of new enemies and puzzles. Also, for the first time ever you can officially unlock the heat element here! We worked hard on this one, so tell us what you think !","+ Added Perfect Guard. Guard at the right moment to nullify any damage. Some attacks might lead to new opportunities.","+ Added \"Break\" Status. This replaces the normal stun but has the same effect. The difference is that breaks can also be inflicted through Perfect Guards.","+ New dramatic effects A.K.A. FREEZE FRAMES. Yes, now we have them too. Finishing of the last wave of enemies or \"Breaking\" an enemy has a more powerful visual effect.","+ True Heat-Skilltree unlocked! The Heat Tree now feature some early skills including 4 new combat arts!","New Skills added! We also changed up some skills. For instance: Charged and Speed Shot skills are now one single Skill called \"Shooter\".  ","+ New items and Quests! There are more to come in future updates","+ Added \"Thief's Key\". A key? But what does it open? ","+ Map menu now displays next area name (if visited) on area edges. ","+ Sort button in menus now display currently selected sort option. Also added HP, ATTACK, DEFENSE and FOCUS sorting to equipment menu. ","+ Added new hidden entries to Synopsis menu. Future releases will gradually unlock them!","~ Skill placement adjusted. Because of this we reset the existing skilltrees in all saves!","~ Adjusted Element Overload with better visual effects","~ Decreased overall difficulty of enemies and increased leveling speed for higher levels.","~ Balanced some equipment.","~ Reworked internal projectiles to work in a more flexible way.","~ Elemental attacks now have better sounds! ","~ Enemies now spawn a bit faster in normal encounters. "]},{"name":"Time to Teleport!","version":"0.3.5","date":"October 15th 2015","fixes":["Fixed various quest related issues again!  "," Fixed issue where battle music keeps playing after respawn.","HOTFIX(2): Fixed mapping glitches.","HOTFIX(2): Fixed colored chest bug."],"changes":["+ Added Teleport System! You now can find \"Landmark\" throughout CrossWorlds which unlock permanent teleport points for you to warp to via the map menu. ","+ A Worldmap appeard! From the Map-Menu you can now go to the worldmap and select all the visited (and visible) areas. This way you can make use of the landmarks to quickly teleport around!","+ Added Locked Chests! 3 new types of Chests can now be found in CrossWorlds. But how to you open them?","+ New sounds for heat and cold elemental attacks.","~ New cursor for map menu. This mainly applies to the cursor visible when using the gamepad.","~ Changed some maps in Autumn's Rise. Better slopes and cliffs.","~ Changed some maps in Bergen Trails. (A strange building emerges...)","~ Changed chest appear animation. Is now in line with item drops from enemies. Looks cooler too!","~ Some Adjustments to enemy placement in Bergen Trail.","~ HOTFIX(2): Positioned Mr. Freeze somewhere else, uhhh."]},{"name":"Minor Fixes and Changes","version":"0.3.2","date":"October 10th 2015","fixes":["No more legend bunny glitch! ","Fixed graphic glitches in circuit menu. ","Added missing German translation for cutscene after escape sequence.","HOTFIX(2): Fixed crashed due to quest states reset.","HOTFIX(3): Fixed quest hub quests - we may have to reset your quest progress. Sorry!","HOTFIX(3): Fixed critical storage system issue."],"changes":["+ New BGM for the cutscene right after Rhombus Dungeon.","~ Changed some enemies drop rates and added \"Frosted Carrot\" drop to White Frobbits (very rare with at least A Combat Rank). "]},{"name":"Quest Fixes and more","version":"0.3.1","date":"October 2nd 2015","fixes":[" Critical fix for quests. Things went very wrong as soon as quests have been solved.","Fix in Jet's tutorial. Target bot now actually detects all the hits."," Several language improvements. (special thanks to Wervyn!)","A certain blue individual can count chests again. "],"changes":["+ New save import\/export feature. Press F10!"]},{"name":"Merging Modes and Quests!","version":"0.3.0","date":"September 30th 2015","fixes":["Various mapping glitches and bugs as usual!","Fixed Trade Dialog opening the \"Currently Equipped\"-Dialog although the equipment is not equipped or is not a requirement. ","Fixed \"Game Code\". Is now correctly called \"Bonus Code\".","Fixed display issue with \"NEW\"- Item Tab and equipped items. ","Double sound glitch in opening sequence with Lea. ","Fixed facing problem when loading checkpoints. ","Items are now correctly hidden when collected during a cutscene "],"changes":["+ Quest-System! Whoop! It's the first version of this system so be nice! ","+ New cutscenes connecting previously separated game modes. Meet new faces and enter Rookie Harbor the correct way!","+ Revamped First Dungeon (formerly known as \"Puzzle Mode\"). Now you have a proper dungeon which even unlocks some abilities! ","+ New Maps in Bergen Trail and Rookie Harbor. Also new maps connecting the 3 game modes.","+ New Snowman and Goat enemies in Bergen Trail.","+ New epic BGM for Bergen Trail.","+ Dynamic NPC-Spawning-System. Random NPCs now run around CrossWorlds!  ","+ Preset Loading! Load from a preset of saves so you don't have to start all over again.","+ Menu Tutorials. Don't worry, there are short and sweet! ","+ Hover over maps in the Map menu to get the map name! Works with gamepad too!","+ Added option to hide Money Notifications. ","+ Added option to increase padding in dialog bubbles\/boxes.","~ When collecting an item it will always move to the top in the \"New\"-Tab. ","~ No more Separation of Gameplay modes! All modes are now connected thorough story!","~ Kept in old saves this time. NOTE: These saves probably break the game. Enjoy! ","~ Adjustment to EXP-Curve. Since we merged the game modes we had to tone down the leveling a bit.  ","~ Tweaked Bergen Trail and Autumn's Rise maps, including chest placement, enemy placement and details.","~ Previous \"Quests\" now use the Quest-System.","~ Ciruit Menu now only displays the CP count for the unlocked elements.","- Removed Carla stats for now. Will be replaced with a shiny new menu soon! "]},{"name":"Last Fixes, we swear!","version":"0.2.2","date":"July 8th 2015","fixes":["Fixed crash after Crabby Redux Boss when leveling up.","Fixed various spelling issues. Keep them coming folks!","Fixed task display staying after observatory challenge","Fixed a bunch of out-of-map glitches in all areas.","Fixed delete button key text to correctly reset. ","HOTFIX(2): Fixed crash when requesting stats from Carla. "],"changes":["+ New chest... mysterious! "]},{"name":"Ye 'ol Bugfixes","version":"0.2.1","date":"July 7th 2015","fixes":[" Fixed crash during escape sequence in story mode.","Fixed crash when resetting options."," Fix to make it impossible to skip acquiring melee."," Fixed game freeze when talking to NPC prior to level up sequence."," Panorama mapping fixes in Bergen Trail."," Fixed from size for level 3 skill connection graphics.","Fixed BGM playback issue when quickly reentering Rookie Harbor from Autumn Rise.","Fixed elemental properties of equiment.","Several map collision and navigation issues.","Fixed being able to reset options to default after leaving options menu. ","Fixed not being able to set item favorites and missing displays in consumables section on first start-up.","Bergen Trail enemies actually drop items now.","Fixed missing cutscene borders and skipping option.","Lea floats again in intro! "]},{"name":"2 New Areas and NPCs","version":"0.2.0","date":"July 6th 2015","fixes":["Fixed crash when switching between detail view and overview in circuit menu.","Fixed various editor related bugs, resulting in crashes.","Fixed path finding issues. Entities are now better in finding a good path. "],"changes":["- Swiped saves because of the large Changes. It had to happen, sorry! \\i[lea2]","+ New Area: Rookie Harbor! Explore the buzzing town where all players start and traders try to sell their goods! Also includes new music by Intero!","+ New Area: Bergen Trail! Not quite done yet but includes 10 new maps, 3 new enemies 7 new trading items and lots of vertical climbing. Get ready. ","+ Added Teleport-NPC to help you get around the increasing amounts of maps faster. ","+ Added a \"New\"-Tab in Item menu. Never miss what you collected again!","+ Added tons of new NPCs + poses. Find them in all the areas you can explore. We added over 20 different types of them. And some might have a quest!","+ Added more \"Xeno-Dialogs\". Finally more NPCs make use of this feature. Lurk in all conversation without pressing a button!","+ Added new equipment! It's missing some cool effects but you can already collect them!","+ Added a quest icon. Quests are still scheduled for 0.3 but we kept the ones we had in for you and made it more clear who gives you a quest!","+ Added new editors to our dev tools to help great assets even faster! ","~ Autumn's Rise Chest have new content! Most of the equipment is gone :(","~ But rejoice! All the trader still have the juicy equipment you want!","~ Ball damage formula slightly changed! You now make more damage with your balls. Kinky.","~ Enemies can now react better to your actions thanks to a system we call \"EnemyTracker\"","~ Made a lot of Adjustments to the Autumn's Rise area so people get less confused by height issues.","~ Re-balanced some the equipment. It's going to happen a lot.","~ Cutscenes are now correctly paused when attempting to skip them. ","~ Started work on Quests and Achievements. Soon to be ready!"]},{"name":"Early Access started!","version":"0.1.6","date":"May 13th, 2015","fixes":["Interacting with NPCs and other objects is not possible anymore while in combat."],"changes":["+ Added new option: 'Item HUD Size'. Changes the size of the item notification window.","+ New \"Xeno Dialogs\": NPCs will have conversations with each other when walking past them.","+ Item Trading NPCs. Trade cool items for other items!","+ Item Destructibles: Destroy plants and similar objects to find new items.","+ Shiny Destructibles: All destructibles come with fancy shining lines. Also, the protected sides are more clearly visible.","+ Game codes: You can enter game codes for fancy\/exclusive gimmicks!","+ New details in Autumn Rise: Visit the amazing laser bridges and futuristic signposts!","+ We started Early Access!","~ Reworked the Item Obtain HUD. Now duplicated are counted into already visible item displays. Also only up to 5 items at a time are displayed."]},{"name":"Idle Animation + Bugs","version":"0.1.5","date":"March 10th 2015","fixes":["Fixed issue where Web audio wasn't used on first startup.","Fixed bug with captain Jet's tutorial.","Fixed with BGM and Sound playback"],"changes":["+ Stretching idle animation for Lea. *yawn*"]},{"name":"German Translation","version":"0.1.4","date":"March 1st 2015","fixes":[],"changes":["+ German Translation! Na endlich!","+ Custom cursor graphics. No more tiny cursor in full screen!"]},{"name":"Whatta buncha fixes","version":"0.1.3","date":"Feb 25th 2015","fixes":["Fixed crash when hovering unimplemented skills with medium\/small size option","Various mapping issues","Collision bugs in exploration and story areas","Throwing a ball after stopping to move a block","Problems with instant text and skipping scenes","Input issues causing bugs like slow motion all the time"],"changes":["+ Changelog view. You're looking at it right now. Awesome!","+ special IndieGogo overlay for the crowdfunding campaign","+ Several new rooms to the puzzle mode and a new boss!","+ Quick menu and usable items","+ Buff HUD for active buffs","+ Money and play time GUI to main menu","+ Chest count display in map menu","+ Dialogs to confirm actions like overriding saves or deleting them.","+ New cutscene skip option by pressing \\i[skip-cutscene] twice.","+ Option to remove the confirmation dialog from cutscene skips. You're welcome speedrunners! ;)","+ Option to reset all settings back to default","+ Complete new help menus with multiple pages and ","+ New BGM for Puzzle and Exploration Mode ","~ Changed the contents of some chests (sorry saves :P)","~ Remixed enemy behaviour and attack patterns.","probably a lot of different stuff we forgot about"]},{"name":"Equipment Fix","version":"0.1.2","date":"Dec 10th 2014","fixes":["Fixed critical problem with missing equipment items"]},{"name":"Bugfixes!","version":"0.1.1","date":"Dec 9th 2014","fixes":["Crashes at various places","Saving\/Loading related issues","Canceling special attacks and other crazy stuff","Display bugs in equipment menu","A whole bunch of map errors","Wrong treasure count in exploration area (ups!)"],"changes":["+ Option to reset neutral skill tree \n(It'll cost you though!)","+ Graphics libraries for standalone version. Might increases performance if you had low fps previously","~ Changed damage formula for better scaling","~ Position when loading save file is now the entry point of the map","~ Shizuka Special now 110% more awesome","Old saves should work (sorry if we broke them), but items might need to be equipped again. "]},{"name":"Initial Demo Release","version":"0.1.0","date":"Dec 1st 2014","changes":["~ Demo Release! whuuu!\\i[lea]"]}]}